[Killed] StringLiteral
src/views/PokemonView.vue:17:11
 import ErrorComponent from '../components/ErrorComponent.vue';
 
 export default {
-    name: 'PokemonView',
+    name: "",
 
     components: {
killedBy: Given PokemonView When the component is rendered Then the name of the component should be PokemonView
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PokemonView"
Received: ""

[Killed] ArrowFunction
src/views/PokemonView.vue:25:11
         ErrorComponent
     },
 
-    data: () => ({
-        pokemons: [],
-        titleImage: require('../assets/image 1.svg'),
-        isLoading: false,
-        isError: false
-    }),
+    data: () => undefined,
 
     computed: {
killedBy: Given PokemonView When the component is rendered Then the name of the component should be PokemonView
statusReason: TypeError: Cannot use 'in' operator to search for 'showPokemons' in undefined

[Killed] BooleanLiteral
src/views/PokemonView.vue:28:20
     data: () => ({
         pokemons: [],
         titleImage: require('../assets/image 1.svg'),
-        isLoading: false,
+        isLoading: true,
         isError: false
     }),
killedBy: Given PokemonView When the component is rendered Then the isLoading is false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/views/PokemonView.vue:29:18
         pokemons: [],
         titleImage: require('../assets/image 1.svg'),
         isLoading: false,
-        isError: false
+        isError: true
     }),
 
killedBy: Given PokemonView When the component is rendered Then the isError is false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/views/PokemonView.vue:33:24
     }),
 
     computed: {
-        showPokemons() {
-            return this.pokemons && !this.isLoading && !this.isError;
-        }
+        showPokemons() {}
     },
 
killedBy: Given PokemonView When validate computed When pokemons: ["Pikachu"], isLoading: false, isError: false, then showPokemons should be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/views/PokemonView.vue:34:56
 
     computed: {
         showPokemons() {
-            return this.pokemons && !this.isLoading && !this.isError;
+            return this.pokemons && !this.isLoading && this.isError;
         }
     },
killedBy: Given PokemonView When validate computed When pokemons: ["Pikachu"], isLoading: false, isError: false, then showPokemons should be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/views/PokemonView.vue:34:20
 
     computed: {
         showPokemons() {
-            return this.pokemons && !this.isLoading && !this.isError;
+            return false;
         }
     },
killedBy: Given PokemonView When validate computed When pokemons: ["Pikachu"], isLoading: false, isError: false, then showPokemons should be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/views/PokemonView.vue:39:31
     },
 
     methods: {
-        async fetchPokemons() {
-            this.isLoading = true;
-            try {
-                this.pokemons = await callApi();
-                this.isLoading = false;
-            }
-            catch (error) {
-                this.isError = true;
-                this.isLoading = false;
-            }
-        },
+        async fetchPokemons() {},
 
         handleTryAgain () {
killedBy: Given PokemonView When validate the method fetchPokemons And the call of fetchPokemons starts Then isLoading is true in the beggining
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/views/PokemonView.vue:40:30
 
     methods: {
         async fetchPokemons() {
-            this.isLoading = true;
+            this.isLoading = false;
             try {
                 this.pokemons = await callApi();
killedBy: Given PokemonView When validate the method fetchPokemons And the call of fetchPokemons starts Then isLoading is true in the beggining
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/views/PokemonView.vue:41:17
     methods: {
         async fetchPokemons() {
             this.isLoading = true;
-            try {
-                this.pokemons = await callApi();
-                this.isLoading = false;
-            }
+            try {}
             catch (error) {
                 this.isError = true;
killedBy: Given PokemonView When validate the method fetchPokemons And the call of api is error Then the isError should be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/views/PokemonView.vue:43:34
             this.isLoading = true;
             try {
                 this.pokemons = await callApi();
-                this.isLoading = false;
+                this.isLoading = true;
             }
             catch (error) {
killedBy: Given PokemonView When validate the method fetchPokemons And the call of api is sucess Then isLoading is false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/views/PokemonView.vue:45:27
                 this.pokemons = await callApi();
                 this.isLoading = false;
             }
-            catch (error) {
-                this.isError = true;
-                this.isLoading = false;
-            }
+            catch (error) {}
         },
 
killedBy: Given PokemonView When validate the method fetchPokemons And the call of api is error Then the isError should be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/views/PokemonView.vue:46:32
                 this.isLoading = false;
             }
             catch (error) {
-                this.isError = true;
+                this.isError = false;
                 this.isLoading = false;
             }
killedBy: Given PokemonView When validate the method fetchPokemons And the call of api is error Then the isError should be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/views/PokemonView.vue:47:34
             }
             catch (error) {
                 this.isError = true;
-                this.isLoading = false;
+                this.isLoading = true;
             }
         },
killedBy: Given PokemonView When validate the method fetchPokemons And the call of api is error Then the isLoading should be false after error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/views/PokemonView.vue:51:27
             }
         },
 
-        handleTryAgain () {
-            this.fetchPokemons();
-        }
+        handleTryAgain () {}
     },
 
killedBy: Given PokemonView When validade the method handleTryAgain Then fetchPokemons should be called
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/views/PokemonView.vue:56:15
         }
     },
 
-    mounted() {
-        this.fetchPokemons();
-    }
+    mounted() {}
 }
 </script>
killedBy: Given PokemonView When the component is rendered Then fetchPokemons is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
