[Killed] BlockStatement
src/views/PokemonView.vue:51:27
             }
         },
 
-        handleTryAgain () {
-            this.isError = false;
-            this.fetchPokemons();
-        }
+        handleTryAgain () {}
     },
 
killedBy: Given PokemonView When validade the method handleTryAgain Then fetchPokemons is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
src/views/PokemonView.vue:52:28
         },
 
         handleTryAgain () {
-            this.isError = false;
+            this.isError = true;
             this.fetchPokemons();
         }
killedBy: Given PokemonView When validade the method handleTryAgain Then isError is false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
